{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "b8e912a8",
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import pandas as pd\n",
    "\n",
    "endpoint = \"https://dbpedia.org/sparql\"\n",
    "\n",
    "def run_query(query, filename):\n",
    "    sparql = SPARQLWrapper(endpoint)\n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "\n",
    "    results = sparql.query().convert()\n",
    "\n",
    "    data = []\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        row = {key: result[key][\"value\"] for key in result}\n",
    "        data.append(row)\n",
    "\n",
    "    df = pd.DataFrame(data)\n",
    "    df.to_csv(filename, index=False)\n",
    "    print(f\"Saved to {filename}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fccb5036",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "f21d2c02",
   "metadata": {},
   "source": [
    "Q1(a) Indian Presidents + Birth Dates"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ea5d2405",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Saved to indian_presidents.csv\n"
     ]
    }
   ],
   "source": [
    "query_a = \"\"\"\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "\n",
    "SELECT ?name ?birthDate WHERE {\n",
    "  ?president a dbo:Person ;\n",
    "             dbo:birthDate ?birthDate ;\n",
    "             rdfs:label ?name ;\n",
    "             dbo:office ?office .\n",
    "\n",
    "  ?office dbo:office dbr:President_of_India .\n",
    "\n",
    "  FILTER (lang(?name) = 'en')\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "run_query(query_a, \"indian_presidents.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "35235110",
   "metadata": {},
   "source": [
    "Q1(b) Entity Types + Count + Sample"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "27ec80b3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Saved to entity_types.csv\n"
     ]
    }
   ],
   "source": [
    "query_b = \"\"\"\n",
    "SELECT ?type (COUNT(?entity) AS ?count) (SAMPLE(?entity) AS ?sample)\n",
    "WHERE {\n",
    "  ?entity a ?type .\n",
    "}\n",
    "GROUP BY ?type\n",
    "ORDER BY DESC(?count)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "run_query(query_b, \"entity_types.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bdcf0360",
   "metadata": {},
   "source": [
    "Q1(c) Subclasses of Place"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "fe4b7850",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Saved to place_subclasses.csv\n"
     ]
    }
   ],
   "source": [
    "query_c = \"\"\"\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "\n",
    "SELECT ?subclass ?parent WHERE {\n",
    "  ?subclass rdfs:subClassOf dbo:Place .\n",
    "  OPTIONAL { ?subclass rdfs:subClassOf ?parent . }\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "run_query(query_c, \"place_subclasses.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "04d615ef",
   "metadata": {},
   "source": [
    "Q1(d) Countries with Most Olympic Medal Winners"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "9c1088ab",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Saved to olympic_winners_by_country.csv\n"
     ]
    }
   ],
   "source": [
    "query_d = \"\"\"\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "\n",
    "SELECT ?country (COUNT(?athlete) AS ?count)\n",
    "WHERE {\n",
    "  ?athlete a dbo:Athlete .\n",
    "  ?athlete dbo:country ?country .\n",
    "}\n",
    "GROUP BY ?country\n",
    "ORDER BY DESC(?count)\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "run_query(query_d, \"olympic_winners_by_country.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1c3a7850",
   "metadata": {},
   "source": [
    "Q1(e) Entities Related to Mahatma Gandhi"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "2c4f4dd9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Saved to gandhi_related_entities.csv\n"
     ]
    }
   ],
   "source": [
    "query_e = \"\"\"\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "\n",
    "SELECT ?property ?value WHERE {\n",
    "  dbr:Mahatma_Gandhi ?property ?value .\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "run_query(query_e, \"gandhi_related_entities.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "243e7880",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix ns1: <http://dbpedia.org/ontology/> .\n",
      "\n",
      "<http://dbpedia.org/resource/A._P._J._Abdul_Kalam> ns1:birthPlace <http://dbpedia.org/resource/Rameswaram> .\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "from rdflib import Graph, URIRef, Namespace\n",
    "\n",
    "# Create graph\n",
    "g = Graph()\n",
    "\n",
    "# Define namespaces\n",
    "dbr = Namespace(\"http://dbpedia.org/resource/\")\n",
    "dbo = Namespace(\"http://dbpedia.org/ontology/\")\n",
    "\n",
    "# Create triple\n",
    "subject = dbr[\"A._P._J._Abdul_Kalam\"]\n",
    "predicate = dbo[\"birthPlace\"]\n",
    "object_ = dbr[\"Rameswaram\"]\n",
    "\n",
    "g.add((subject, predicate, object_))\n",
    "\n",
    "# Print in Turtle format\n",
    "print(g.serialize(format=\"turtle\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b3c51012",
   "metadata": {},
   "source": [
    "# Q3. Construct an RDF graph for the following  information:\n",
    "     Sachin Tendulkar is a cricketer\n",
    "     He was born in Mumbai\n",
    "     He plays for India"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "52505aaa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix dbo: <http://dbpedia.org/ontology/> .\n",
      "@prefix dbr: <http://dbpedia.org/resource/> .\n",
      "\n",
      "dbr:Sachin_Tendulkar a dbo:Cricketer ;\n",
      "    dbo:birthPlace dbr:Mumbai ;\n",
      "    dbo:team dbr:India_national_cricket_team .\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "from rdflib import Graph, Namespace\n",
    "from rdflib.namespace import RDF\n",
    "\n",
    "# Create graph\n",
    "g = Graph()\n",
    "\n",
    "# Namespaces\n",
    "dbr = Namespace(\"http://dbpedia.org/resource/\")\n",
    "dbo = Namespace(\"http://dbpedia.org/ontology/\")\n",
    "\n",
    "# Bind prefixes (for clean output)\n",
    "g.bind(\"dbr\", dbr)\n",
    "g.bind(\"dbo\", dbo)\n",
    "\n",
    "# Subject\n",
    "sachin = dbr[\"Sachin_Tendulkar\"]\n",
    "\n",
    "# Triples\n",
    "\n",
    "# Sachin Tendulkar is a cricketer\n",
    "g.add((sachin, RDF.type, dbo[\"Cricketer\"]))\n",
    "\n",
    "# Born in Mumbai\n",
    "g.add((sachin, dbo[\"birthPlace\"], dbr[\"Mumbai\"]))\n",
    "\n",
    "# Plays for India\n",
    "g.add((sachin, dbo[\"team\"], dbr[\"India_national_cricket_team\"]))\n",
    "\n",
    "# Print graph in Turtle format\n",
    "print(g.serialize(format=\"turtle\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "07ecdae2",
   "metadata": {},
   "source": [
    "# Q4. Using DBpedia SPARQL endpoint, extract:\n",
    "    All entities related to \"A.P.J. Abdul Kalam\"\n",
    "    Their relationship types"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "589e8cf0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Saved to kalam_relations.csv\n"
     ]
    }
   ],
   "source": [
    "query_q4 = \"\"\"\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "\n",
    "SELECT ?relation ?entity\n",
    "WHERE {\n",
    "  dbr:A._P._J._Abdul_Kalam ?relation ?entity .\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "run_query(query_q4, \"kalam_relations.csv\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c13a000b",
   "metadata": {},
   "source": [
    "# Q5. Use DBpedia to:\n",
    "    ● Extract entities from a given Wikipedia paragraph\n",
    "    ● Identify relationships\n",
    "    ● Generate a knowledge graph representation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "cc1b7e58",
   "metadata": {},
   "outputs": [],
   "source": [
    "text = \"\"\"\n",
    "A.P.J. Abdul Kalam was the President of India.\n",
    "He was born in Rameswaram and worked at ISRO.\n",
    "\"\"\" \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "ce2b29a2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Extracted Entities: ['A.P.J. Abdul Kalam', 'India', 'Rameswaram', 'ISRO']\n"
     ]
    }
   ],
   "source": [
    "import spacy\n",
    "\n",
    "nlp = spacy.load(\"en_core_web_sm\")\n",
    "\n",
    "doc = nlp(text)\n",
    "\n",
    "entities = [ent.text for ent in doc.ents]\n",
    "\n",
    "print(\"Extracted Entities:\", entities)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "384f48ba",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "DBpedia Entities: ['http://dbpedia.org/resource/A._P._J._Abdul_Kalam', 'http://dbpedia.org/resource/President_of_the_United_States', 'http://dbpedia.org/resource/India', 'http://dbpedia.org/resource/Rameswaram', 'http://dbpedia.org/resource/Indian_Space_Research_Organisation']\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "\n",
    "url = \"https://api.dbpedia-spotlight.org/en/annotate\"\n",
    "headers = {\"accept\": \"application/json\"}\n",
    "params = {\"text\": text}\n",
    "\n",
    "response = requests.get(url, headers=headers, params=params)\n",
    "\n",
    "data = response.json()\n",
    "\n",
    "linked_entities = [res[\"@URI\"] for res in data[\"Resources\"]]\n",
    "\n",
    "print(\"DBpedia Entities:\", linked_entities)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3ced1785",
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "endpoint = \"https://dbpedia.org/sparql\"\n",
    "\n",
    "def get_relations(entity_uri):\n",
    "    query = f\"\"\"\n",
    "    SELECT ?relation ?object\n",
    "    WHERE {{\n",
    "      <{entity_uri}> ?relation ?object .\n",
    "    }}\n",
    "    LIMIT 50\n",
    "    \"\"\"\n",
    "\n",
    "    sparql = SPARQLWrapper(endpoint)\n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "\n",
    "    results = sparql.query().convert()\n",
    "\n",
    "    relations = []\n",
    "    for r in results[\"results\"][\"bindings\"]:\n",
    "        relations.append((r[\"relation\"][\"value\"], r[\"object\"][\"value\"]))\n",
    "\n",
    "    return relations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "9f755ec6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix foaf: <http://xmlns.com/foaf/0.1/> .\n",
      "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
      "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
      "\n",
      "<http://dbpedia.org/resource/A._P._J._Abdul_Kalam> a <http://dbpedia.org/ontology/Animal>,\n",
      "        <http://dbpedia.org/ontology/Eukaryote>,\n",
      "        <http://dbpedia.org/ontology/Person>,\n",
      "        <http://dbpedia.org/ontology/Politician>,\n",
      "        <http://dbpedia.org/ontology/Species>,\n",
      "        <http://schema.org/Person>,\n",
      "        <http://umbel.org/umbel/rc/PersonWithOccupation>,\n",
      "        <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#NaturalPerson>,\n",
      "        owl:Thing,\n",
      "        <http://www.wikidata.org/entity/Q19088>,\n",
      "        <http://www.wikidata.org/entity/Q215627>,\n",
      "        <http://www.wikidata.org/entity/Q5>,\n",
      "        <http://www.wikidata.org/entity/Q729>,\n",
      "        <http://www.wikidata.org/entity/Q82955>,\n",
      "        foaf:Person ;\n",
      "    owl:sameAs <http://be.dbpedia.org/resource/Абдул_Калам>,\n",
      "        <http://ca.dbpedia.org/resource/Abdul_Kalam>,\n",
      "        <http://d-nb.info/gnd/124468047>,\n",
      "        <http://da.dbpedia.org/resource/Abdul_Kalam>,\n",
      "        <http://data.europa.eu/euodp/jrc-names/Abdul_Kalam>,\n",
      "        <http://de.dbpedia.org/resource/A._P._J._Abdul_Kalam>,\n",
      "        <http://el.dbpedia.org/resource/Αμπντούλ_Καλάμ>,\n",
      "        <http://es.dbpedia.org/resource/Abdul_Kalam>,\n",
      "        <http://et.dbpedia.org/resource/Abdul_Kalam>,\n",
      "        <http://fr.dbpedia.org/resource/Avul_Pakir_Jainulabdeen_Abdul_Kalam>,\n",
      "        <http://he.dbpedia.org/resource/עבדול_קאלאם>,\n",
      "        <http://id.dbpedia.org/resource/Abdul_Kalam>,\n",
      "        <http://it.dbpedia.org/resource/Abdul_Kalam>,\n",
      "        <http://ja.dbpedia.org/resource/アブドゥル・カラーム>,\n",
      "        <http://ko.dbpedia.org/resource/압둘_칼람>,\n",
      "        <http://nl.dbpedia.org/resource/Abdul_Kalam>,\n",
      "        <http://pl.dbpedia.org/resource/A.P.J._Abdul_Kalam>,\n",
      "        <http://pt.dbpedia.org/resource/A._P._J._Abdul_Kalam>,\n",
      "        <http://rdf.freebase.com/ns/m.0gy3f>,\n",
      "        <http://ru.dbpedia.org/resource/Абдул_Калам>,\n",
      "        <http://sv.dbpedia.org/resource/Abdul_Kalam>,\n",
      "        <http://sw.cyc.com/concept/Mx4rKbzeuNkMRMGVgCCOJAhQJQ>,\n",
      "        <http://sw.cyc.com/concept/Mx4rP6wsAbArEdiUkQACs4vPnA>,\n",
      "        <http://tr.dbpedia.org/resource/Ebubekir_Zeynelabidin_Abdülkelam>,\n",
      "        <http://vi.dbpedia.org/resource/A._P._J._Abdul_Kalam>,\n",
      "        <http://viaf.org/viaf/49404258>,\n",
      "        <http://www.wikidata.org/entity/Q9513>,\n",
      "        <http://yago-knowledge.org/resource/A._P._J._Abdul_Kalam>,\n",
      "        <http://zh.dbpedia.org/resource/阿卜杜尔·卡拉姆> .\n",
      "\n",
      "<http://dbpedia.org/resource/Indian_Space_Research_Organisation> a owl:Thing ;\n",
      "    owl:sameAs <http://an.dbpedia.org/resource/ISRO>,\n",
      "        <http://ar.dbpedia.org/resource/منظمة_البحوث_الفضائية_الهندية>,\n",
      "        <http://ast.dbpedia.org/resource/Axencia_India_d'Investigación_Espacial>,\n",
      "        <http://bg.dbpedia.org/resource/Индийска_организация_за_космически_изследвания>,\n",
      "        <http://bn.dbpedia.org/resource/ভারতীয়_মহাকাশ_গবেষণা_সংস্থা>,\n",
      "        <http://bs.dbpedia.org/resource/Indijska_organizacija_za_istraživanje_svemira>,\n",
      "        <http://ca.dbpedia.org/resource/Indian_Space_Research_Organisation>,\n",
      "        <http://ckb.dbpedia.org/resource/دەزگای_بۆشاییی_ھیند>,\n",
      "        <http://commons.dbpedia.org/resource/Indian_Space_Research_Organisation>,\n",
      "        <http://cs.dbpedia.org/resource/Indická_kosmická_agentura>,\n",
      "        <http://cy.dbpedia.org/resource/ISRO>,\n",
      "        <http://d-nb.info/gnd/1092104321>,\n",
      "        <http://d-nb.info/gnd/2078014-X>,\n",
      "        <http://d-nb.info/gnd/4101356-6>,\n",
      "        <http://data.europa.eu/euodp/jrc-names/Indian_Space_Research_Organization>,\n",
      "        <http://de.dbpedia.org/resource/Indian_Space_Research_Organisation>,\n",
      "        <http://el.dbpedia.org/resource/Ινδικός_Οργανισμός_Διαστημικής_Έρευνας>,\n",
      "        <http://eo.dbpedia.org/resource/Barata_Organizo_pri_Kosmo_Esplorado>,\n",
      "        <http://es.dbpedia.org/resource/Agencia_India_de_Investigación_Espacial>,\n",
      "        <http://fa.dbpedia.org/resource/سازمان_پژوهش‌های_فضایی_هند>,\n",
      "        <http://fi.dbpedia.org/resource/Intian_avaruustutkimusjärjestö>,\n",
      "        <http://fr.dbpedia.org/resource/Organisation_indienne_pour_la_recherche_spatiale>,\n",
      "        <http://gu.dbpedia.org/resource/ઇસરો>,\n",
      "        <http://he.dbpedia.org/resource/הארגון_ההודי_לחקר_החלל>,\n",
      "        <http://hi.dbpedia.org/resource/भारतीय_अंतरिक्ष_अनुसंधान_संगठन>,\n",
      "        <http://hr.dbpedia.org/resource/Indijska_svemirska_istraživačka_organizacija>,\n",
      "        <http://hu.dbpedia.org/resource/Indiai_Űrkutatási_Szervezet>,\n",
      "        <http://ia.dbpedia.org/resource/Organisation_Indian_de_Recercar_Spatial>,\n",
      "        <http://id.dbpedia.org/resource/Organisasi_Penelitian_Luar_Angkasa_India>,\n",
      "        <http://is.dbpedia.org/resource/Geimrannsóknastofnun_Indlands>,\n",
      "        <http://it.dbpedia.org/resource/Indian_Space_Research_Organisation>,\n",
      "        <http://ja.dbpedia.org/resource/インド宇宙研究機関>,\n",
      "        <http://kn.dbpedia.org/resource/ಭಾರತೀಯ_ಬಾಹ್ಯಾಕಾಶ_ಸಂಶೋಧನಾ_ಸಂಸ್ಥೆ>,\n",
      "        <http://ko.dbpedia.org/resource/인도우주연구기구>,\n",
      "        <http://lb.dbpedia.org/resource/Indian_Space_Research_Organisation>,\n",
      "        <http://lv.dbpedia.org/resource/Indijas_Kosmosa_pētījumu_organizācija>,\n",
      "        <http://mk.dbpedia.org/resource/Индиска_организација_за_вселенско_истражување>,\n",
      "        <http://nl.dbpedia.org/resource/Indian_Space_Research_Organisation>,\n",
      "        <http://pl.dbpedia.org/resource/Indyjska_Organizacja_Badań_Kosmicznych>,\n",
      "        <http://pt.dbpedia.org/resource/Organização_Indiana_de_Pesquisa_Espacial>,\n",
      "        <http://rdf.freebase.com/ns/m.03zwkz>,\n",
      "        <http://ru.dbpedia.org/resource/Индийская_организация_космических_исследований>,\n",
      "        <http://sv.dbpedia.org/resource/Indian_Space_Research_Organisation>,\n",
      "        <http://tr.dbpedia.org/resource/Hindistan_Uzay_Araştırma_Organizasyonu>,\n",
      "        <http://vi.dbpedia.org/resource/ISRO>,\n",
      "        <http://viaf.org/viaf/133195349>,\n",
      "        <http://www.wikidata.org/entity/Q229058>,\n",
      "        <http://yago-knowledge.org/resource/Indian_Space_Research_Organisation>,\n",
      "        <http://zh.dbpedia.org/resource/印度空间研究组织> .\n",
      "\n",
      "<http://dbpedia.org/resource/President_of_the_United_States> a <http://dbpedia.org/ontology/Animal>,\n",
      "        <http://dbpedia.org/ontology/Eukaryote>,\n",
      "        <http://dbpedia.org/ontology/Person>,\n",
      "        <http://dbpedia.org/ontology/Politician>,\n",
      "        <http://dbpedia.org/ontology/President>,\n",
      "        <http://dbpedia.org/ontology/Species>,\n",
      "        owl:Thing ;\n",
      "    rdfs:seeAlso <http://dbpedia.org/resource/List_of_presidents_of_the_United_States>,\n",
      "        <http://dbpedia.org/resource/United_States_Electoral_College>,\n",
      "        <http://dbpedia.org/resource/United_States_presidential_debates> ;\n",
      "    owl:sameAs <http://af.dbpedia.org/resource/President_van_die_Verenigde_State_van_Amerika>,\n",
      "        <http://am.dbpedia.org/resource/የአሜሪካ_ፕሬዚዳንት>,\n",
      "        <http://an.dbpedia.org/resource/President_d'os_Estaus_Unius>,\n",
      "        <http://api.nytimes.com/svc/semantic/v2/concept/name/nytd_des/Presidents%20and%20Presidency%20(US)>,\n",
      "        <http://ar.dbpedia.org/resource/رئيس_الولايات_المتحدة>,\n",
      "        <http://arz.dbpedia.org/resource/رئيس_امريكا>,\n",
      "        <http://ast.dbpedia.org/resource/Presidente_d'Estaos_Xuníos>,\n",
      "        <http://be.dbpedia.org/resource/Прэзідэнт_ЗША>,\n",
      "        <http://ca.dbpedia.org/resource/President_dels_Estats_Units>,\n",
      "        <http://commons.dbpedia.org/resource/President_of_the_United_States>,\n",
      "        <http://d-nb.info/gnd/1085239535>,\n",
      "        <http://d-nb.info/gnd/1088175112>,\n",
      "        <http://d-nb.info/gnd/2033432-1>,\n",
      "        <http://d-nb.info/gnd/4047019-2>,\n",
      "        <http://da.dbpedia.org/resource/USA's_præsident>,\n",
      "        <http://de.dbpedia.org/resource/Präsident_der_Vereinigten_Staaten>,\n",
      "        <http://el.dbpedia.org/resource/Πρόεδρος_των_Ηνωμένων_Πολιτειών>,\n",
      "        <http://es.dbpedia.org/resource/Presidente_de_los_Estados_Unidos>,\n",
      "        <http://et.dbpedia.org/resource/Ameerika_Ühendriikide_president>,\n",
      "        <http://fr.dbpedia.org/resource/Président_des_États-Unis>,\n",
      "        <http://he.dbpedia.org/resource/נשיא_ארצות_הברית>,\n",
      "        <http://hu.dbpedia.org/resource/Az_Amerikai_Egyesült_Államok_elnöke>,\n",
      "        <http://id.dbpedia.org/resource/Presiden_Amerika_Serikat>,\n",
      "        <http://it.dbpedia.org/resource/Presidente_degli_Stati_Uniti_d'America>,\n",
      "        <http://ja.dbpedia.org/resource/アメリカ合衆国大統領>,\n",
      "        <http://ko.dbpedia.org/resource/미국의_대통령>,\n",
      "        <http://nl.dbpedia.org/resource/President_van_de_Verenigde_Staten>,\n",
      "        <http://pl.dbpedia.org/resource/Prezydent_Stanów_Zjednoczonych>,\n",
      "        <http://pt.dbpedia.org/resource/Presidente_dos_Estados_Unidos>,\n",
      "        <http://rdf.freebase.com/ns/m.060d2>,\n",
      "        <http://ro.dbpedia.org/resource/Președinte_al_Statelor_Unite_ale_Americii>,\n",
      "        <http://ru.dbpedia.org/resource/Президент_США>,\n",
      "        <http://sv.dbpedia.org/resource/USA:s_president>,\n",
      "        <http://tr.dbpedia.org/resource/Amerika_Birleşik_Devletleri_başkanı>,\n",
      "        <http://vi.dbpedia.org/resource/Tổng_thống_Hoa_Kỳ>,\n",
      "        <http://viaf.org/viaf/123879793>,\n",
      "        <http://viaf.org/viaf/129529146>,\n",
      "        <http://www.wikidata.org/entity/Q11696>,\n",
      "        <http://zh.dbpedia.org/resource/美国总统> .\n",
      "\n",
      "<http://dbpedia.org/resource/Rameswaram> a <http://dbpedia.org/ontology/Location>,\n",
      "        <http://dbpedia.org/ontology/Place>,\n",
      "        <http://dbpedia.org/ontology/PopulatedPlace>,\n",
      "        <http://dbpedia.org/ontology/Settlement>,\n",
      "        <http://dbpedia.org/ontology/Town>,\n",
      "        <http://schema.org/Place>,\n",
      "        owl:Thing,\n",
      "        <http://www.w3.org/2003/01/geo/wgs84_pos#SpatialThing>,\n",
      "        <http://www.wikidata.org/entity/Q3957>,\n",
      "        <http://www.wikidata.org/entity/Q486972> ;\n",
      "    owl:sameAs <http://ar.dbpedia.org/resource/رامسوارام>,\n",
      "        <http://arz.dbpedia.org/resource/راميشورم>,\n",
      "        <http://bn.dbpedia.org/resource/রামেশ্বরম>,\n",
      "        <http://bpy.dbpedia.org/resource/রামেশ্বরম>,\n",
      "        <http://ca.dbpedia.org/resource/Rameswaram>,\n",
      "        <http://ceb.dbpedia.org/resource/Rameswaram_(lungsod_sa_Indiya)>,\n",
      "        <http://d-nb.info/gnd/4778627-9>,\n",
      "        <http://de.dbpedia.org/resource/Rameswaram>,\n",
      "        <http://es.dbpedia.org/resource/Rameswaram>,\n",
      "        <http://et.dbpedia.org/resource/Rāmeswaram>,\n",
      "        <http://fa.dbpedia.org/resource/رامشوارام>,\n",
      "        <http://fi.dbpedia.org/resource/Rameswaram>,\n",
      "        <http://fr.dbpedia.org/resource/Rameswaram>,\n",
      "        <http://gu.dbpedia.org/resource/રામેશ્વરમ>,\n",
      "        <http://hi.dbpedia.org/resource/रामेश्वरम_शहर>,\n",
      "        <http://hu.dbpedia.org/resource/Rámesvaram>,\n",
      "        <http://it.dbpedia.org/resource/Rameswaram>,\n",
      "        <http://ja.dbpedia.org/resource/ラーメーシュワラム>,\n",
      "        <http://kn.dbpedia.org/resource/ರಾಮೇಶ್ವರಮ್>,\n",
      "        <http://ko.dbpedia.org/resource/라메스와람>,\n",
      "        <http://lt.dbpedia.org/resource/Ramešvaramas>,\n",
      "        <http://mg.dbpedia.org/resource/Rameswaram>,\n",
      "        <http://nl.dbpedia.org/resource/Rameswaram_(Ramanathapuram)>,\n",
      "        <http://pl.dbpedia.org/resource/Rameswaram>,\n",
      "        <http://pt.dbpedia.org/resource/Rameswaram>,\n",
      "        <http://rdf.freebase.com/ns/m.020p_p>,\n",
      "        <http://ru.dbpedia.org/resource/Рамешварам>,\n",
      "        <http://sv.dbpedia.org/resource/Rameswaram_(ort_i_Indien)>,\n",
      "        <http://sws.geonames.org/1258698/>,\n",
      "        <http://vi.dbpedia.org/resource/Rameswaram>,\n",
      "        <http://viaf.org/viaf/141948433>,\n",
      "        <http://www.wikidata.org/entity/Q1435144>,\n",
      "        <http://yago-knowledge.org/resource/Rameswaram>,\n",
      "        <http://zh.dbpedia.org/resource/拉梅斯沃勒姆_(泰米尔纳德邦)> .\n",
      "\n",
      "<http://dbpedia.org/resource/India> a <http://dbpedia.org/ontology/Country>,\n",
      "        <http://dbpedia.org/ontology/Location>,\n",
      "        <http://dbpedia.org/ontology/Place>,\n",
      "        <http://dbpedia.org/ontology/PopulatedPlace>,\n",
      "        <http://schema.org/Country>,\n",
      "        <http://schema.org/Place>,\n",
      "        <http://umbel.org/umbel/rc/Country>,\n",
      "        <http://umbel.org/umbel/rc/Location_Underspecified>,\n",
      "        <http://umbel.org/umbel/rc/PopulatedPlace>,\n",
      "        owl:Thing,\n",
      "        <http://www.w3.org/2003/01/geo/wgs84_pos#SpatialThing>,\n",
      "        <http://www.wikidata.org/entity/Q6256> ;\n",
      "    rdfs:seeAlso <http://dbpedia.org/resource/Constitution_of_India>,\n",
      "        <http://dbpedia.org/resource/Democracy>,\n",
      "        <http://dbpedia.org/resource/Energy_policy_of_India>,\n",
      "        <http://dbpedia.org/resource/Ethnic_groups_in_South_Asia>,\n",
      "        <http://dbpedia.org/resource/India>,\n",
      "        <http://dbpedia.org/resource/Indian_physical_culture>,\n",
      "        <http://dbpedia.org/resource/Literacy>,\n",
      "        <http://dbpedia.org/resource/Political_integration_of_India> ;\n",
      "    owl:sameAs <http://api.nytimes.com/svc/semantic/v2/concept/name/nytd_geo/India>,\n",
      "        <http://commons.dbpedia.org/resource/India>,\n",
      "        <http://d-nb.info/gnd/4026722-2>,\n",
      "        <http://de.dbpedia.org/resource/Indien>,\n",
      "        <http://es.dbpedia.org/resource/India>,\n",
      "        <http://eurostat.linked-statistics.org/dic/c_ctrl#IN>,\n",
      "        <http://fr.dbpedia.org/resource/Inde>,\n",
      "        <http://ghodata/r6-c83>,\n",
      "        <http://it.dbpedia.org/resource/India>,\n",
      "        <http://linked-web-apis.fit.cvut.cz/resource/india_country>,\n",
      "        <http://linkedgeodata.org/triplify/node424314145>,\n",
      "        <http://nl.dbpedia.org/resource/India>,\n",
      "        <http://openei.org/resources/India>,\n",
      "        <http://pl.dbpedia.org/resource/Indie>,\n",
      "        <http://rdf.freebase.com/ns/m.03rk0>,\n",
      "        <http://sw.cyc.com/concept/Mx4rvVj7XJwpEbGdrcN5Y29ycA>,\n",
      "        <http://tr.dbpedia.org/resource/Hindistan>,\n",
      "        <http://transparency.270a.info/classification/country/IN>,\n",
      "        <http://viaf.org/viaf/135375457>,\n",
      "        <http://worldbank.270a.info/classification/country/IN>,\n",
      "        <http://www.wikidata.org/entity/Q20523028>,\n",
      "        <http://www.wikidata.org/entity/Q668>,\n",
      "        <http://www4.wiwiss.fu-berlin.de/factbook/resource/India>,\n",
      "        <http://yago-knowledge.org/resource/India>,\n",
      "        <http://yago-knowledge.org/resource/India?> .\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "from rdflib import Graph, URIRef\n",
    "\n",
    "g = Graph()\n",
    "\n",
    "for entity in linked_entities:\n",
    "    relations = get_relations(entity)\n",
    "\n",
    "    for rel, obj in relations:\n",
    "        g.add((URIRef(entity), URIRef(rel), URIRef(obj)))\n",
    "\n",
    "print(g.serialize(format=\"turtle\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "295191f8",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "spark_env",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.19"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
